export type NewsMeta = {
  id: number
  title: string
  date: string
}

export const news: NewsMeta[] = [
  { id: 20, date: "2025/7/15", title: "夏季休業と休業に伴う発送のご案内" },
  // { id: 19, date: "2025/7/1", title: "ハピネスプラザ「新小岩]オープンのお知らせ" },
  // { id: 18, date: "2025/5/26", title: "ハピネスプラザ「雪が谷大塚]オープンのお知らせ" },
  // { id: 17, date: "2025/4/9", title: "ハピネスプラザ「練馬春日町]オープンのお知らせ" },
  // { id: 16, date: "2025/3/25", title: "ハピネスプラザ「希望ヶ丘]オープンのお知らせ" },
  { id: 15, date: "2025/1/31", title: "本社休業と休業に伴う発送のご案内" },
  // { id: 14, date: "2025/1/7", title: "ハピネスプラザ「亀有4丁目]オープンのお知らせ" },
  { id: 13, date: "2025/1/1", title: "新年のご挨拶" },
  { id: 12, date: "2024/12/13", title: "冬季休業と休業に伴う発送のご案内" },
  // { id: 11, date: "2024/11/29", title: "ハピネスプラザ「新松戸]オープンのお知らせ" },
  // { id: 10, date: "2024/9/25", title: "ハピネスプラザ　リニューアルオープンのお知らせ" },
  // { id: 9, date: "2024/9/25", title: "ハピネスプラザ「蘇我]オープンのお知らせ" },
  { id: 8, date: "2024/8/1", title: "夏季休業と休業に伴う発送のご案内" },
  // { id: 7, date: "2024/7/10", title: "ハピネスプラザ「東久留米滝山]オープンのお知らせ" },
  // { id: 6, date: "2024/6/24", title: "ハピネスプラザ「久喜青葉]オープンのお知らせ" },
  // { id: 5, date: "2024/6/24", title: "ハピネスプラザ「大泉学園通り]オープンのお知らせ" },
  // { id: 4, date: "2024/4/18", title: "ハピネスプラザ「祖師ヶ谷大蔵]オープンのお知らせ" },
  { id: 3, date: "2024/4/15", title: "せんげん台「2周年記念」バスツアー" },
  { id: 2, date: "2024/3/25", title: "【重要なお知らせ】出張費価格改定のお知らせ" },
  // { id: 1, date: "2024/3/15", title: "ハピネスプラザ　移転リニューアルオープンのお知らせ" },

].sort((a, b) => (a.date < b.date ? 1 : -1))
